`homework_emp_251110.sql`에 작성하세요.

```sql
-- 1. EMPLOYEE 테이블에서 이름 끝이 `연`으로 끝나는 사원의 이름을 출력하시오. 

-- 2. EMPLOYEE 테이블에서 전화번호 처음 3자리가 `010`이 아닌 사원의 이름, 전화번호를 출력하시오.

-- 3. EMPLOYEE 테이블에서 메일주소 '_'의 앞이 4자이면서, DEPT_CODE가 `D9` 또는 `D5`이고 고용일이 `90/01/01` ~ `01/12/31`이면서, 월급이 270만원 이상인 사원의 전체 정보를 출력하시오.

-- 4. EMPLOYEE 테이블에서 현재 근무 중인 사원을 이름 오름차순으로 정렬해서 출력하세요.

-- 5. 사원별 입사일, 퇴사일, 근무기간(일)을 조회하세요. 퇴사자 역시 조회되어야 합니다. 
```

### grouping 처리
```
-- 6. EMPLOYEE 테이블에서 여자사원의 급여 총 합을 계산
-- (주민등록번호를 이용해 남여사원을 구분하세요.)

-- 7. 부서코드가 D5인 사원들의 급여총합, 보너스 총합 조회

-- 8. 부서코드가 D5인 직원의 보너스 포함 연봉의 총합 을 계산

-- 9. 남/여 사원 급여합계를 동시에 표현(가공된 컬럼의 합계)

-- 10.  EMPLOYEE 테이블에서 실제 사원들이 소속되어있는 부서의 수를 조회 (유령부서 제외)
-- (NULL은 제외하고, 중복된 부서는 하나로 카운팅)
```